<template>
<div class="text-light">
    <h1>Итоги похода</h1>
    <div v-if="page=='page1'">
        <div class="form-group row">
            <label class="ml-3 h4">Количественная характеристика пройденного маршрута</label><div class="hint__circle" title="Tooltip on top">?</div>
        <table class="table table-dark mb-0">
            <thead>
                <tr>
                <th scope="col">Категория<br> сложности</th>
                <th scope="col">Протяженность<br>  активной части</th>
                <th scope="col">Продолжительность<br> активной части</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                <th scope="row">0</th>
                <td>30.5 км</td>
                <td>3 дней</td>
                </tr>
            </tbody>
        </table>
        </div>
        <div class="form-group row">
            <label class="ml-3 h4">Технические итоги</label><div class="hint__circle" title="Tooltip on top">?</div>
            <textarea class="form-control ml-3 mr-3" rows="8">Средний вес раскладки на 1 человека — 545 г в день.Вес личного снаряжения 16,1 (13,3) кг Вес группового снаряжения 7,2 кг Питание 9,0 кг Итого: 32,3 кгТропа вдоль реки Аккем — вокруг тайга, ели, кедровые сосны, ягоды, сам Аккем, мощным потоком несет белые воды.
Разноцветные скалы и осыпи в долинах рек Ярлу и Текелю.
Ледник Менсу — самый длинный и очень красивый ледник Алтая.
Водопад Менсу — потрясающая мощь!
Аккемская стена.</textarea>
        </div>
        <div class="form-group row">
            <label class="ml-3 h4">Технические рекомендации</label><div class="hint__circle" title="Tooltip on top">?</div>
            <textarea class="form-control ml-3 mr-3" rows="8">Полиэтиленовую трубу можно надеть поверх себя и рюкзака, так что дождевая вода не будет затекать за шиворот, кроме того она лучше вентилируется, чем куртка, на ночь в ней же укрывается рюкзак, а также это индивидуальное укрытие на аварийный случай.</textarea>
        </div>
    </div>
    <div class="container-fluid" v-if="page=='page2'">
        <div class="form-group row">
            <label class="ml-3 h4">Организационные итоги</label>
            <textarea class="form-control ml-3 mr-3" rows="10">Перевал Ярлу-Боч (1А) — очень красивый обзорный перевал. С него открывается прекрасный вид в сторону долины Аккема, очень красив и сам перевал. В жаркую погоду могут досаждать слепни (в этот раз не было).
Перевал Кара-Айры Южный (1Б). Перевальное седло практически не выделяется в хребте, нужно искать по координатам. Перевал представляет собой возможный путь с ледника Текелю Восточный в северный цирк перевала ОКА. Перевал осыпной, с достаточно неприятной осыпью, лежащей местами на скалах. Не рекомендуем перевал к прохождению в походах 2 категории сложности.
Перевал ОКА (1Б). Хороший перевал, соответствующий 1Б категории сложности. С севера умеренно крутой открытый ледник, который проходится ногами. С юга средняя и мелкая осыпь, которая относительно хорошо лежит. Кроме перевального взлета трудоемким является спуск из долины реки Эдогыр к реке Иедыгем по травянисто- осыпному склону.
Связка перевалов Кара-Айры Южный — ОКА — дает возможность пройти из долины реки Текелю в долину реки Эдогыр и при дальнейшем движении в сторону ледника Менсу пройти по долине реки Иедыгем. Обе долины очень красивы. Ввиду того, что перевал Менсу выводит на восток почти к языку леднику Менсу, а также в силу неприятности перевала Кара-Айры считаем целесообразным рассмотреть прохождения перевалов Сулу-Боч (н/к) и ОКА (1Б).
Перевал Титова. В зависимости от года сложность прохождения на подъем с востока может меняться (высота стенки бергшрунда). Нужна повышенная осторожность при прохождении западного склона — отдельные блоки осыпи очень подвижны, а ввиду размеров при падении опасны даже не набрав скорость</textarea>
        </div>
        <div class="form-group row">
            <label class="ml-3 h4">Организационные рекомендации</label>
            <textarea class="form-control ml-3 mr-3" rows="10">При подготовке маршрута нужно искать большее количество описаний перевалов и сравнивать их между собой, так как в описаниях могут быть ошибки и неточности.
При подготовке маршрута изучать описания соседних перевалов в районе (в том числе на полкатегории-категорию сложности выше, чем планируемые в данном маршруте). Например просмотр и сравнение фотографий перевала Менсу со стороны ледника Текелю дало бы возможность еще при подготовке похода заметить ошибочность подписи перевала Кара-Айры на фотографии из отчета [3].
Планировать запасные варианты даже для перевалов, которые не являются определяющими для категории маршрута и особенно для перевалов по которым нет свежих описаний или их мало. Есть вероятность, что их категория сложности или их опасность изменилась, была недооценена или будет неприемлема для конкретной группы.</textarea>
        </div>
    </div>
</div>
</template>

<script>
export default {
    props: ['page'],
    name: 'HikeResultsComponent',
}
</script>
